; domain
(define (domain hanoi)
(:requirements :strips)
(:predicates (clear ?x)
             (on ?x ?y)
             (smaller ?x ?y))

(:action move
:parameters (?disc ?from ?to)
:precondition (and (smaller ?disc ?to) 
                   (on ?disc ?from) 
                   (clear ?disc) 
                   (clear ?to))
:effect  (and (clear ?from) 
              (on ?disc ?to) 
              (not (on ?disc ?from))  
              (not (clear ?to)))
 ))

; problem
(define (problem hanoi1)
    (:domain hanoi)
    (:objects
        peg1
        peg2
        peg3
        orange_disk
        red_disk
        blue_disk
        pink_disk
    )
    (:init
        (clear pink_disk)
        (clear peg2)
        (clear peg3)
        (on pink_disk blue_disk)
        (on blue_disk red_disk)
        (on red_disk orange_disk)
        (on orange_disk peg1)
        (smaller pink_disk blue_disk)
        (smaller pink_disk red_disk)
        (smaller pink_disk orange_disk)
        (smaller blue_disk red_disk)
        (smaller blue_disk orange_disk)
        (smaller red_disk orange_disk)
        (smaller pink_disk peg1)
        (smaller pink_disk peg2)
        (smaller pink_disk peg3)
        (smaller blue_disk peg1)
        (smaller blue_disk peg2)
        (smaller blue_disk peg3)
        (smaller red_disk peg1)
        (smaller red_disk peg2)
        (smaller red_disk peg3)
        (smaller orange_disk peg1)
        (smaller orange_disk peg2)
        (smaller orange_disk peg3)
    )
    (:goal (and 
        (on orange_disk peg3) 
        (on red_disk orange_disk) 
        (on blue_disk red_disk) 
        (on pink_disk blue_disk)
    ))
)

; plan
1. (move pink_disk blue_disk peg2)
   deleted: (on pink_disk blue_disk) (clear peg2)
   added: (clear blue_disk) (on pink_disk peg2)
   goals met: 2 of 4
2. (move blue_disk red_disk peg3)
   deleted: (on blue_disk red_disk) (clear peg3)
   added: (clear red_disk) (on blue_disk peg3)
   goals met: 1 of 4
3. (move pink_disk peg2 blue_disk)
   deleted: (on pink_disk peg2) (clear blue_disk)
   added: (clear peg2) (on pink_disk blue_disk)
   goals met: 2 of 4
4. (move red_disk orange_disk peg2)
   deleted: (on red_disk orange_disk) (clear peg2)
   added: (clear orange_disk) (on red_disk peg2)
   goals met: 1 of 4
5. (move pink_disk blue_disk orange_disk)
   deleted: (on pink_disk blue_disk) (clear orange_disk)
   added: (clear blue_disk) (on pink_disk orange_disk)
   goals met: 0 of 4
6. (move blue_disk peg3 red_disk)
   deleted: (on blue_disk peg3) (clear red_disk)
   added: (clear peg3) (on blue_disk red_disk)
   goals met: 1 of 4
7. (move pink_disk orange_disk blue_disk)
   deleted: (on pink_disk orange_disk) (clear blue_disk)
   added: (clear orange_disk) (on pink_disk blue_disk)
   goals met: 2 of 4
8. (move orange_disk peg1 peg3)
   deleted: (on orange_disk peg1) (clear peg3)
   added: (clear peg1) (on orange_disk peg3)
   goals met: 3 of 4
9. (move pink_disk blue_disk orange_disk)
   deleted: (on pink_disk blue_disk) (clear orange_disk)
   added: (clear blue_disk) (on pink_disk orange_disk)
   goals met: 2 of 4
10. (move blue_disk red_disk peg1)
   deleted: (on blue_disk red_disk) (clear peg1)
   added: (clear red_disk) (on blue_disk peg1)
   goals met: 1 of 4
11. (move pink_disk orange_disk blue_disk)
   deleted: (on pink_disk orange_disk) (clear blue_disk)
   added: (clear orange_disk) (on pink_disk blue_disk)
   goals met: 2 of 4
12. (move red_disk peg2 orange_disk)
   deleted: (on red_disk peg2) (clear orange_disk)
   added: (clear peg2) (on red_disk orange_disk)
   goals met: 3 of 4
13. (move pink_disk blue_disk peg2)
   deleted: (on pink_disk blue_disk) (clear peg2)
   added: (clear blue_disk) (on pink_disk peg2)
   goals met: 2 of 4
14. (move blue_disk peg1 red_disk)
   deleted: (on blue_disk peg1) (clear red_disk)
   added: (clear peg1) (on blue_disk red_disk)
   goals met: 3 of 4
15. (move pink_disk peg2 blue_disk)
   deleted: (on pink_disk peg2) (clear blue_disk)
   added: (clear peg2) (on pink_disk blue_disk)
   goals met: 4 of 4
